benchmark/old_outputs/thread_equals_client/clock/zipf_16/2026-04-19T21:40:50-04:00_9_1_1.5.txt
pgbench (19devel)
transaction type: multiple scripts
scaling factor: 1000
query mode: simple
number of clients: 16
number of threads: 16
maximum number of tries: 1
duration: 180 s
number of transactions actually processed: 12004124
number of failed transactions: 0 (0.000%)
latency average = 0.240 ms
initial connection time = 5.181 ms
tps = 66689.059826 (without initial connection time)
SQL script 1: pgscripts/zipfian_select.sql
 - weight: 9 (targets 90.0% of total)
 - 10673483 transactions (88.9% of total)
 - number of transactions actually processed: 10673483 (tps = 59296.667240)
 - number of failed transactions: 0 (0.000%)
 - latency average = 0.135 ms
 - latency stddev = 0.047 ms
SQL script 2: pgscripts/zipfian_update.sql
 - weight: 1 (targets 10.0% of total)
 - 1198115 transactions (10.0% of total)
 - number of transactions actually processed: 1198115 (tps = 6656.142748)
 - number of failed transactions: 0 (0.000%)
 - latency average = 1.188 ms
 - latency stddev = 1.449 ms
ratio: .9990151794911278